const catalog = [
    'Бытовая техника',
    'Красота и здоровье',
    'Смартфоны и фототехника',
    'ТВ, консоли и аудио',
    'ПК, ноутбуки, периферия',
    'Комплектующие для ПК',
    'Офис и мебель',
    'Сетевое оборудование',
    'Отдых и развлечения',
    'Инструмент и стройка',
    'Садовая техника',
    'Дом, декор и посуда',
    'Умный дом',
    'Автотовары',
    'Аксессуары и услуги',
    'Расширяем ассортимент',
    'Уценённые товары'
]

const transliterate = (text) => {
    const translitMap = {
        'А': 'A', 'Б': 'B', 'В': 'V', 'Г': 'G', 'Д': 'D', 'Е': 'E', 'Ё': 'YO', 'Ж': 'ZH', 'З': 'Z',
        'И': 'I', 'Й': 'Y', 'К': 'K', 'Л': 'L', 'М': 'M', 'Н': 'N', 'О': 'O', 'П': 'P', 'Р': 'R',
        'С': 'S', 'Т': 'T', 'У': 'U', 'Ф': 'F', 'Х': 'KH', 'Ц': 'TS', 'Ч': 'CH', 'Ш': 'SH', 'Щ': 'SCH',
        'Ь': '', 'Ы': 'Y', 'Ъ': '', 'Э': 'E', 'Ю': 'YU', 'Я': 'YA', 'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g',
        'д': 'd', 'е': 'e', 'ё': 'yo', 'ж': 'zh', 'з': 'z', 'и': 'i', 'й': 'y', 'к': 'k', 'л': 'l',
        'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'kh',
        'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'sch', 'ь': '', 'ы': 'y', 'ъ': '', 'э': 'e', 'ю': 'yu', 'я': 'ya',
        ' ': '-'
    }
    return text.split('').map(char => translitMap[char] || char).join('')
}

const createCatalogLinks = (catalog) => {
    return catalog.map(item => {
        const link = transliterate(item).toLowerCase()
        return {
            title: item,
            url: `/catalog/${link}`
        }
    })
}


const catalogLinks = createCatalogLinks(catalog);
console.log(catalogLinks);